revk/ESP8266-RevK/src/ESPRevK.cpp
// See include file for more details

#include <ESPRevK.h>

#ifdef ARDUINO_ESP8266_NODEMCU
#define BOARD "nodemcu"
#else
#define BOARD "generic"
#endif

#include <ESP8266httpUpdate.h>
#include <EEPROM.h>
extern "C"
{
#include "sntp.h"
}

//#define GRATARP       10000 // Send gratuitous ARP periodically (no, does not actually help stay on WiFi, FFS)
#ifdef	GRATARP
#include "lwip/etharp.h"
#endif

              // Local functions
static void myclient (WiFiClient & client);
static void myclientTLS (WiFiClientSecure &, const byte * sha1 = NULL);
static boolean pub (boolean retain, const char *prefix, const char *suffix, const __FlashStringHelper * fmt, ...);
static boolean pub (const char *prefix, const char *suffix, const __FlashStringHelper * fmt, ...);
static boolean pub (const __FlashStringHelper * prefix, const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, ...);
static boolean pub (boolean retain, const __FlashStringHelper * prefix, const __FlashStringHelper * suffix,
                    const __FlashStringHelper * fmt, ...);
boolean settings_save ();
boolean setting_apply (const char *name, const byte * value, size_t len);

// App name set by constructor, expceted to be static string
static const char *appname = NULL;      // System set from constructor as literal string
static const char *appversion = NULL;   // System set from constructor as literal string
static int appnamelen = 0;      // May be truncated
static long do_restart = 0;     // Do a restart in main loop cleanly
static long do_upgrade = 0;     // Do an OTA upgrade
static char mychipid[7];

// Some defaults
#define	OTAHOST			"ota.revk.uk"
#define MQTTHOST		"mqtt.iot"
#define WIFISSID                "IoT"
#define WIFIPASS                "security"
#define       WIFISCANRATE            300

#define s(name) static const char *name=NULL
#define n(name,def) static int name=def;
#define f(name,len) static const byte *name=NULL
revk_settings
#undef 	f
#undef 	s
#undef n
typedef struct setting_s setting_t;
struct setting_s
{
   setting_t *next;
   const char *tag;             // PROGMEM
   byte len;
   const byte value[0];
};
#define	MAXEEPROM 1024          // EEPROM storage
const char eepromsig[] = "RevK";
static setting_t *set = NULL;   // The settings
static unsigned int setlen = sizeof (eepromsig) + 1;
static long settingsupdate = 0; // When to do a settings update (delay after settings changed, 0 if no change)

      // Local variables
WiFiClient mqttclient;
WiFiClientSecure mqttclientsecure;
PubSubClient mqtt;
boolean mqttbackup = false;
long mqttbackoff = 100;
long mqttretry = mqttbackoff;
int mqttcount = 0;

static const char *
strdup_P (const char *p)
{
   const char *m = (const char *) malloc (strlen_P (p) + 1);
   strcpy_P ((char *) m, p);
   return m;
}

static int wificount = 0;       // Count of connects
static volatile int wifidiscause = -1;  // Last disconnect cause

static const char *thisssid = NULL;     // Last creds used
static const char *lastssid = NULL;     // Last creds used
static const char *thispass = NULL;
static const char *lastpass = NULL;
static const byte *thisbssid = NULL;
static const byte *lastbssid = NULL;
static byte thischan = 0;
static byte lastchan = 0;
static boolean thisbssidfixed = false;
static boolean lastbssidfixed = false;

static const byte copybssid[6] = { };

static WiFiEventHandler wifidisconnecthandler = NULL;
static void
wifidisconnect (const WiFiEventStationModeDisconnected & event)
{                               // Event handler
   wifidiscause = event.reason;
}

static void
wifitry (const char *ssid, const char *passphrase, int32_t channel, const uint8_t * bssid)
{                               // try a connection and confirm if it worked
   if (bssid)
      debugf ("WiFi try %s%s %d %02X:%02X:%02X:%02X:%02X:%02X", ssid, passphrase ? "" : " (open)", channel, bssid[0], bssid[1],
              bssid[2], bssid[3], bssid[4], bssid[5]);
   else
      debugf ("WiFi try %s%s %d", ssid, passphrase ? "" : " (open)", channel);
   uint8_t status;
   status = WiFi.status ();
   if (status != WL_DISCONNECTED && status != WL_IDLE_STATUS)
   {                            // Should not really happen, we should only be here if disconnected
      debug ("WiFi force disconnect?");
      WiFi.disconnect ();
      delay (100);
   }
   thisssid = ssid;
   thispass = passphrase;
   thischan = channel;
   if (bssid)
   {
      thisbssidfixed = true;
      memcpy ((void *) copybssid, (void *) bssid, sizeof (copybssid));
      thisbssid = copybssid;
   }
   wifidiscause = 0;            // Stays 0 until we fail or later disconnect
   WiFi.begin (thisssid, thispass, thischan, thisbssid, true);
}

static boolean
wificonnect ()
{                               // Try and reconnect
   static int wifiseq = 0;
   if (!wifidiscause)
   {                            // We are trying, or connected
      if (!WiFi.isConnected ())
         return false;          // Still trying
      if (!thischan)
         thischan = WiFi.channel ();
      if (!thisbssid)
      {
         memcpy ((void *) copybssid, (void *) WiFi.BSSID (), sizeof (copybssid));
         thisbssid = copybssid;
      }
      lastssid = thisssid;
      lastpass = thispass;
      lastchan = thischan;
      lastbssid = thisbssid;
      lastbssidfixed = thisbssidfixed;
      debugf ("WiFi connected %s %d %02X:%02X:%02X:%02X:%02X:%02X RSSI %d", lastssid, lastchan, lastbssid[0], lastbssid[1],
              lastbssid[2], lastbssid[3], lastbssid[4], lastbssid[5], WiFi.RSSI ());
      wifiseq = 0;
      return true;
   }
   // Let's try and connect
   wificount++;                 // Connect attempt count
   if (wifiseq >= 3 && wifissid3)
      wifitry (wifissid3, wifipass3, wifichan3, wifibssid3);
   else if (wifiseq >= 2 && wifissid2)
      wifitry (wifissid2, wifipass2, wifichan2, wifibssid2);
   else if (wifiseq >= 1 && wifissid)
      wifitry (wifissid, wifipass, wifichan, wifibssid);
   else if (lastssid)
      wifitry (lastssid, lastpass, lastchan, lastbssid);
   wifiseq++;
   if (wifiseq == 4)
      wifiseq = 0;
   return false;
}

static void
wifiscan ()
{                               // Check for stronger signal if we are not locked to a bssid
   static long scannext = 1000;
   if (lastbssidfixed)
      return;                   // Fixed BSSID
   if (scannext && (int) (scannext - millis ()) >= 0)
      return;                   // Waiting
   if (scannext)
   {                            // Start a scan
      //debug ("WiFi scan");
      scannext = 0;
      WiFi.scanNetworks (true, false, 0, (uint8 *) lastssid);
      return;
   }
   int n = WiFi.scanComplete ();
   if (n < 0)
      return;
   debugf ("WiFi scan found %d", n);
   scannext = (millis () + WIFISCANRATE * 1000 ? : 1);  // Next scan
   int best = -1,
      bestrssi = 0;
   while (n--)
   {                            // Check for better signal
      if (best < 0 || WiFi.RSSI (n) > bestrssi)
      {
         bestrssi = WiFi.RSSI (n);
         best = n;
      }
   }
   if (best >= 0 && bestrssi > WiFi.RSSI () && memcmp ((void *) lastbssid, (void *) WiFi.BSSID (best), 6))
   {                            // Switch to better wifi
      lastchan = WiFi.channel (best);
      memcpy ((void *) (lastbssid = copybssid), (void *) WiFi.BSSID (best), sizeof (copybssid));
      if (best >= 0)
         debugf ("WiFi better %d %02X:%02X:%02X:%02X:%02X:%02X RSSI %d", lastchan, lastbssid[0], lastbssid[1], lastbssid[2],
                 lastbssid[3], lastbssid[4], lastbssid[5], bestrssi);
      WiFi.disconnect ();
   }
   WiFi.scanDelete ();
}


static long wifidown = 0;
static boolean
domqttopen (boolean silent = false)
{
   const char *host = (mqttbackup ? mqtthost2 : mqtthost);
   if (!host)
      return false;
   mqttcount++;
   if (mqttbackup)
   {
      debugf ("MQTT backup insecure %s", mqtthost2);
      myclient (mqttclient);
      //mqttclient.setNoDelay (true);
      mqtt.setClient (mqttclient);
      mqtt.setServer (mqtthost2, 1883);
   } else
   {
      if (mqttsha1)
      {
         debugf ("MQTT main secure %s", mqtthost);
         myclientTLS (mqttclientsecure, mqttsha1);
         //mqttclientsecure.setNoDelay (true);
         mqtt.setClient (mqttclientsecure);
         mqtt.setServer (mqtthost, mqttport ? atoi (mqttport) : 8883);
      } else
      {
         debugf ("MQTT main insecure %s", mqtthost);
         myclient (mqttclient);
         mqtt.setClient (mqttclient);
         //mqttclient.setNoDelay (true);
         mqtt.setServer (mqtthost, mqttport ? atoi (mqttport) : 1883);
      }
   }
   char topic[101];
   snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s"), prefixstate, appnamelen, appname, hostname);
   if (!mqtt.connect (hostname, mqttbackup ? NULL : mqttuser, mqttbackup ? NULL : mqttpass, topic, MQTTQOS1, true, "0 Fail"))
      return false;
   // Worked
   mqttretry = 0;
   mqttbackoff = 1000;
   // Specific device
   snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s/#"), prefixcommand, appnamelen, appname, hostname);
   mqtt.subscribe (topic);
   snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s/#"), prefixsetting, appnamelen, appname, hostname);
   mqtt.subscribe (topic);
   // All devices
   snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/*/#"), prefixcommand, appnamelen, appname);
   mqtt.subscribe (topic);
   snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/*/#"), prefixsetting, appnamelen, appname);
   mqtt.subscribe (topic);
   debugf ("MQTT connected %s", host);
   if (silent)
      return true;
   pub (true, prefixstate, NULL, F ("1 %s"), appversion);
   unsigned int now = millis ();
   pub (prefixinfo, NULL,
        F ("Up %d.%03d, flash %dKiB, W%d M%d, WiFi %s %d %02X:%02X:%02X:%02X:%02X:%02X RSSI %d Down %d.%03d"),
        now / 1000, now % 1000, ESP.getFlashChipRealSize () / 1024, wificount, mqttcount, lastssid, lastchan,
        lastbssid[0], lastbssid[1], lastbssid[2], lastbssid[3], lastbssid[4], lastbssid[5], WiFi.RSSI (),
        wifidown / 1000, wifidown % 1000);
   app_command ("connect", (const byte *) host, strlen ((char *) host));
   return true;
}

#define PCPY(x) strdup_P(PSTR(x))

void
settings_reset ()
{                               // Invalidate settings
   EEPROM.begin (MAXEEPROM);
   EEPROM.write (0, 0);
   EEPROM.end ();
}

