revk/ESP8266-RevK/src/ESPRevK.cpp
boolean
settings_save ()
{
   if (!settingsupdate)
      return true;              // OK(not saved)
   if (!appnamelen)
      return false;             // No app name, minimal load to load app
   EEPROM.begin (MAXEEPROM);
   unsigned int addr = 0,
      i,
      l;
   EEPROM.write (addr++, 0);
   for (i = 0; i < sizeof (eepromsig) - 1; i++)
      EEPROM.write (addr++, eepromsig[i]);
   EEPROM.write (addr++, appnamelen);
   for (i = 0; i < appnamelen; i++)
      EEPROM.write (addr++, appname[i]);
   setting_t *s;
   for (s = set; s; s = s->next)
   {
      l = strlen_P (s->tag);
      char temp[50];
      if (!l || l > sizeof (temp) - 1 || s->len > 255)
      {
         debugf ("Cannot save %S as bad length (%d)", s->tag, s->len);
         continue;              // Cannot save
      }
      strcpy_P (temp, s->tag);
      EEPROM.write (addr++, l);
      for (i = 0; i < l; i++)
         EEPROM.write (addr++, temp[i]);
      EEPROM.write (addr++, s->len);
      for (i = 0; i < s->len; i++)
         EEPROM.write (addr++, ((char *) s->value)[i]);
   }
   EEPROM.write (addr++, 0);    // End of settings
   EEPROM.write (0, sizeof (eepromsig) - 1);    // Make settings valid
   debugf ("Settings saved, used %d/%d bytes", addr, MAXEEPROM);
   EEPROM.end ();
   settingsupdate = 0;
   return true;                 // Done
}

boolean
loadsettings ()
{
   debug ("Load settings");
   unsigned int addr = 0,
      i,
      l;
   EEPROM.begin (MAXEEPROM);
   i = 0;
   l = EEPROM.read (addr++);
   if (l == sizeof (eepromsig) - 1)
      for (i = 0; i < sizeof (eepromsig) - 1 && EEPROM.read (addr++) == eepromsig[i]; i++);
   if (!i || i != sizeof (eepromsig) - 1)
   {
      settingsupdate = (millis ()? : 1);        // Save settings
      debug ("EEPROM not set");
      EEPROM.end ();
      return false;             // Check app name
   }
   i = 0;
   l = EEPROM.read (addr++);
   if (!appnamelen)
      addr += l;                // Skip
   else
   {
      if (l == appnamelen)
         for (i = 0; i < appnamelen && EEPROM.read (addr++) == appname[i]; i++);
      if (!i || i != appnamelen)
      {
         if (appnamelen)
            settingsupdate = (millis ()? : 1);  // Save settings
         debug ("EEPROM different app");
         EEPROM.end ();
         return false;          // Check app name
      }
   }
   char name[33];
   byte value[257];
   boolean bad = false;
   while (1)
   {
      l = EEPROM.read (addr++);
      if (!l)
         break;
      if (l >= sizeof (name))
      {                         // Bad name, skip
         debugf ("Bad name len to read (%d)", l);
         addr += l;
         //Skip name
         l = EEPROM.read (addr++);
         addr += l;
         //Skip value
         continue;
      }
      for (i = 0; i < l; i++)
         name[i] = EEPROM.read (addr++);
      name[i] = 0;
      l = EEPROM.read (addr++);
      for (i = 0; i < l; i++)
         value[i] = EEPROM.read (addr++);
      value[i] = 0;
      if (!setting_apply (name, value, l) && appnamelen)
         bad = true;
   }
   EEPROM.end ();
   if (!bad)
      settingsupdate = 0;       // No need to save
   do_restart = 0;              // Not changed key settings
   debug ("Loaded settings");
   return true;
}

static int
doupdate (char *url)
{
   debugf ("Do update %s", url);
   int ret = 0;
   if (mqtt.connected ())
   {
      pub (true, prefixstate, NULL, F ("0 OTA https://%s%s"), otahost, url);
      mqtt.disconnect ();
      delay (100);
      mqttclientsecure.stop ();
   }
   debugf ("OTA https://%s%s", otahost, url);
   int ok = 0;
   if (otasha1)
   {
      WiFiClientSecure client;
      myclientTLS (client, otasha1);
      ok = ESPhttpUpdate.update (client, String (otahost), 443, String (url));
   } else
   {
      WiFiClientSecure client;
      myclientTLS (client);
      ok = ESPhttpUpdate.update (client, String (otahost), 443, String (url));
   }
   debugf ("OTA done %s", ESPhttpUpdate.getLastErrorString ().c_str ());
   if (domqttopen (true))
   {
      if (ok)
         pub (true, prefixstate, NULL, F ("0 OTA Reboot"));
      else
         pub (true, prefixstate, NULL, F ("0 OTA Error %s"), ESPhttpUpdate.getLastErrorString ().c_str ());
   }
   return ok ? 0 : ESPhttpUpdate.getLastError ();
}

boolean
upgrade (int appnamelen, const char *appname)
{                               // Do OTA upgrade
   debug ("Upgrade start");
   settings_save ();
   char url[200];
   {
      int p = 0,
         e = sizeof (url) - 1;
      url[p++] = '/';
      if (appnamelen)
         p += snprintf_P (url + p, e - p, PSTR ("%.*s"), appnamelen, appname);
      else
      {                         // Check flash for saved app name
         EEPROM.begin (MAXEEPROM);
         int addr = 0;
         int l = EEPROM.read (addr++),
            i;
         if (l)
         {
            addr += l;
            l = EEPROM.read (addr++);
            if (l)
               for (i = 0; i < l; i++)
                  if (p < e)
                     url[p++] = EEPROM.read (addr++);
         }
         EEPROM.end ();
      }
      if (p < e)
         p += snprintf_P (url + p, e - p, PSTR ("%S"), PSTR (".ino." BOARD ".bin"));
      url[p] = 0;
   }
   ESPhttpUpdate.rebootOnUpdate (false);
   int er = doupdate (url);
   if (er == HTTP_UE_TOO_LESS_SPACE)
   {                            // try smaller which should then be able to load the real code.
      snprintf_P (url, sizeof (url), PSTR ("Minimal..ino." BOARD ".bin"));
      er = doupdate (url);
   } else if (er)
      er = doupdate (url);      // Do again, it seems TLS can take too long for the header check, WTF, but session is cached to should work second time
   if (mqtt.connected ())
   {
      mqtt.disconnect ();
      delay (100);
   }
   WiFi.disconnect ();
   delay (100);
   ESP.restart ();              // Boot
   ESP.reset ();                // Boot hard (?)
   return false;                // Should not get here
}

const char *
localsetting (const char *name, const byte * value, size_t len)
{                               // Apply a local setting (return PROGMEM tag)
   if (mqtthost && !strcmp_P (name, PSTR ("mqtthost")) && (!len || strcmp (mqtthost, (char *) value)) && mqtt.connected ())
   {
      pub (true, prefixstate, NULL, F ("0 Config change"));
      mqtt.disconnect ();
      delay (100);
   }
#define s(n) do{const char*t=PSTR(#n);if(!strcmp_P(name,t)){n=(const char*)value;return t;}}while(0)
#define n(n,d) do{const char*t=PSTR(#n);if(!strcmp_P(name,t)){n=(len?atoi((const char*)value):d);return t;}}while(0)
#define f(n,l) do{const char*t=PSTR(#n);if(!strcmp_P(name,t)){if(len&&len!=l)return NULL;n=value;return t;}}while(0)
   revk_settings
#undef f
#undef s
#undef n
      return NULL;
}

#define isxchar(c) ((c)>='0'&&(c)<='9'||(c)>='a'&&(c)<='f'||(c)>='A'&&(c)<='F')

