revk/ESP8266-RevK/src/ESPRevK.cpp
boolean
setting_apply (const char *tag, const byte * value, size_t len)
{                               // Apply a setting
   if (!tag)
   {
      debug ("Cannot handle null tag");
      return false;
   }
   if (len > 255)
   {
      debugf ("Setting %s too long (%d)", tag, len);
      return false;             // Too big
   }
   // New setting
   setting_t *news = NULL;      // New setting
   const byte *val = NULL;      // Value in new setting
   if (tag[0] == '0' && tag[1] == 'x')
   {                            // Convert from Hex
      tag += 2;                 // Strip 0x
      if (len)
      {                         // Has a value
         const byte *e = value + len;
         const byte *i = value;
         size_t n = 0;
         while (i < e)
         {
            if (!isxchar (*i))
               break;
            i++;
            if (i < e && isxchar (*i))
               i++;
            while (i < e && (*i == ' ' || *i == ':'))
               i++;
            n++;
         }
         len = n;
         news = (setting_t *) malloc (sizeof (*news) + len + 1);
         val = news->value;
         i = value;
         const byte *o = val;
         while (i < e)
         {
            if (!isxchar (*i))
               break;
            byte v = (*i & 0xF) + (*i >= 'A' ? 9 : 0);
            i++;
            if (i < e && isxchar (*i))
            {
               v = (v << 4) + (*i & 0xF) + (*i >= 'A' ? 9 : 0);
               i++;
            }
            while (i < e && (*i == ' ' || *i == ':'))
               i++;
            *(byte *) o++ = v;
         }
         *(byte *) o = 0;
         news->len = len;
      }
   } else if (len)
   {                            // Create new setting with new value
      news = (setting_t *) malloc (sizeof (*news) + len + 1);
      val = news->value;
      memcpy ((void *) val, (void *) value, len);
      ((char *) val)[len] = 0;
      news->len = len;
   }
   const char *newtag = NULL;
   // Existing setting
   setting_t **ss = &set;
   while (*ss && strcmp_P (tag, (*ss)->tag))
      ss = &(*ss)->next;
   if (!*ss && !news)
   {
      debugf ("Non setting: %s", tag);
      return true;              // No new value and no existing value
   }
   if (*ss && news && (*ss)->len == len && !memcmp ((*ss)->value, val, len))
   {                            // Same
      debugf ("Unchanged setting: %s %.*s (%d)", tag, len, val, len);
      free (news);
      return true;              // Value has not changed
   }
   debugf ("Setting: %s %.*s (%d)", tag, len, val, len);
   unsigned int newlen = setlen;
   if (*ss)
      newlen -= strlen (tag) + 1 + (*ss)->len + 1;
   if (news)
      newlen += strlen (tag) + 1 + len + 1;
   if (newlen > MAXEEPROM)
   {
      debugf ("Settings would take too much space %d/%d", newlen, MAXEEPROM);
      if (news)
         free (news);
      return false;             // Not a setting we know
   }
   if (!(newtag = localsetting (tag, val, len)) && !(newtag = app_setting (tag, val, len)))
   {                            // Setting not accepted
      debugf ("Bad setting: %s", tag);
      if (news)
         free (news);
      return false;             // Not a setting we know
   }
   setlen = newlen;
   if (*ss)
   {                            // Delete setting
      setting_t *s = *ss;
      *ss = s->next;
      free (s);
   }
   if (news)
   {                            // Add new setting
      news->tag = newtag;
      news->next = set;
      set = news;
   }
   settingsupdate = ((millis () + 1000) ? : 1);
   if (settingsupdate && !strcasecmp_P (tag, PSTR ("hostname")))
      do_restart = (millis ()? : 1);
   return true;                 // Found(not changed)
}

static void
message (const char *topic, byte * payload, unsigned int len)
{                               // Handle MQTT message
   debugf ("MQTT msg %s %.*s (%d)", topic, len, payload, len);
   char *p = strchr (topic, '/');
   if (!p)
      return;
   // Find the suffix
   p = strrchr (p + 1, '/');
   if (p)
      p++;
   else
      p = NULL;
   int l;
   l = strlen (prefixcommand);
   if (p && !strncasecmp (topic, prefixcommand, l) && topic[l] == '/')
   {
      if (!strcasecmp_P (p, PSTR ("upgrade")))
      {                         // OTA upgrade
         if (len)
            upgrade (len, (const char *) payload);      // App specific - special case
         else
            do_upgrade = (millis ()? : 1);
         return;
      }
      if (!strcasecmp_P (p, PSTR ("restart")))
      {
         do_restart = (millis ()? : 1);
         return;
      }
      if (!strcasecmp_P (p, PSTR ("factory")) && len == appnamelen + 6 && !memcmp (mychipid, payload, 6)
          && !memcmp (appname, payload + 6, appnamelen))
      {                         // Factory reset
         settings_reset ();
         do_restart = (millis ()? : 1);
         return;
      }
      if (!app_command (p, payload, len))
         pub (prefixerror, p, F ("Bad command"));
      return;
   }
   l = strlen (prefixsetting);
   if (p && !strncasecmp (topic, prefixsetting, l) && topic[l] == '/')
   {
      if (!setting_apply (p, payload, len))
         pub (prefixerror, p, F ("Bad setting"));
      return;
   }
}

void
preinit ()
{
#ifndef REVKDEBUG
   Serial.end ();               // If needed, then begin will be used
   pinMode (1, INPUT);
#endif
}

ESPRevK::ESPRevK (const char *myappname, const char *myappversion, const char *myotahost, const char *mymqtthost,
                  const char *mywifissid, const char *mywifipass)
{
#ifdef REVKDEBUG
   Serial.begin (115200);
#endif
   debugf ("App: %s", myappname);
   debugf ("Ver: %s", myappversion);
   snprintf_P (mychipid, sizeof (mychipid), PSTR ("%06X"), ESP.getChipId ());
   chipid = mychipid;
   debugf ("ID: %s", chipid);
   if (myappversion)
      strncpy (appver, myappversion, sizeof (appver));
   if (myappversion && strlen (myappversion) == 20 && !isdigit (*myappversion))
   {                            // Messing with version, horrid
      // We are assuming app version is __DATE__" "__TIME__, e.g. "May 13 2019 07:35:27"
      int m = 0,
         d = atoi (myappversion + 4);
      if (myappversion[0] == 'J')
      {
         if (myappversion[1] == 'a')
            m = 1;
         else if (myappversion[1] == 'u')
         {
            if (myappversion[2] == 'n')
               m = 6;
            else if (myappversion[2] == 'l')
               m = 7;
         }
      } else if (myappversion[0] == 'F')
         m = 2;
      else if (myappversion[0] == 'M')
      {
         if (myappversion[1] == 'a')
         {
            if (myappversion[2] == 'r')
               m = 3;
            else if (myappversion[2] == 'y')
               m = 5;
         }
      } else if (myappversion[0] == 'A')
      {
         if (myappversion[1] == 'p')
            m = 4;
         else if (myappversion[1] == 'u')
            m = 8;
      } else if (myappversion[0] == 'S')
         m = 9;
      else if (myappversion[0] == 'O')
         m = 10;
      else if (myappversion[0] == 'N')
         m = 11;
      else if (myappversion[0] == 'D')
         m = 12;
      snprintf (appver, sizeof (appver), "%.4s-%02d-%02d %.8s", myappversion + 7, m, d, myappversion + 12);
      appversion = appver;
   }
   debug ("RevK start");
   if (myappname)
   {                            // Fudge appname - Strip leading whatever / or whatever \ (windows)
      int i,
        l = strlen (myappname);
      for (i = l; i && myappname[i - 1] != '.' && myappname[i - 1] != '/' && myappname[i - 1] != '\\'; i--);
      if (i && myappname[i - 1] == '.')
         l = --i;
      for (; i && myappname[i - 1] != '/' && myappname[i - 1] != '\\'; i--);
      appname = myappname + i;
      appnamelen = l - i;
   }
   setlen += appnamelen + 1;
   debugf ("Application start %.*s %s", appnamelen, appname, appversion);
   loadsettings ();
   // Override defaults
   if (!otahost && myotahost)
      otahost = myotahost;
   if (!wifissid && !wifipass && mywifipass)
      wifipass = mywifipass;
   if (!wifissid && mywifissid)
      wifissid = mywifissid;
   if (!mqtthost && mymqtthost)
      mqtthost = mymqtthost;
   if (!hostname)
      hostname = chipid;
   // My defaults
#ifdef	WIFIPASS
   if (!wifissid && !wifipass)
      wifipass = PCPY (WIFIPASS);
#endif
#ifdef	WIFISSID
   if (!wifissid)
      wifissid = PCPY (WIFISSID);
#endif
#ifdef OTAHOST
   if (!otahost || !*otahost)
      otahost = PCPY (OTAHOST);
#endif
#ifdef MQTTHOST
   if (!mqtthost)
      mqtthost = PCPY (MQTTHOST);
#endif
   if (mqtthost && !*mqtthost)
      mqtthost = NULL;
   if (mqtthost2 && !*mqtthost2)
      mqtthost2 = NULL;
   if (!prefixcommand)
      prefixcommand = PCPY ("command");
   if (!prefixsetting)
      prefixsetting = PCPY ("setting");
   if (!prefixstate)
      prefixstate = PCPY ("state");
   if (!prefixerror)
      prefixerror = PCPY ("error");
   if (!prefixinfo)
      prefixinfo = PCPY ("info");
   if (!prefixevent)
      prefixevent = PCPY ("event");
   char host[100];
   snprintf_P (host, sizeof (host), PSTR ("%.*s-%s"), appnamelen, appname, hostname);
   debugf ("WiFi %s", host);
   WiFi.mode (WIFI_STA);
   wifi_station_set_hostname (host);
   WiFi.setAutoConnect (false); // On start
   WiFi.setAutoReconnect (false);       // On loss (we connect)
   wifidisconnecthandler = WiFi.onStationModeDisconnected (wifidisconnect);
   sntp_set_timezone (0);       // UTC please
   if (ntphost)
      sntp_setservername (0, (char *) ntphost);
   WiFi.setSleepMode (WIFI_NONE_SLEEP); // We assume we have no power issues
   mqtt.setCallback (message);
   debug ("RevK init done");
}

ESPRevK::ESPRevK (const char *myappname, const __FlashStringHelper * myappversion, const char *myotahost,
                  const char *mymqtthost, const char *mywifissid, const char *mywifipass)
{
   char temp[21];
   *temp = 0;
   if (myappversion)
      strncpy_P (temp, (PGM_P) myappversion, sizeof (temp));
   ESPRevK (myappname, temp, myotahost, mymqtthost, mywifissid, mywifipass);
}

boolean ESPRevK::loop ()
{
   unsigned long
      now = (millis ()? : 1);   // Use with care as wraps every 49 days
   if (do_restart && (int) (do_restart - now) <= 0)
   {
      debug ("Restart");
      settings_save ();
      if (mqtt.connected ())
      {
         pub (true, prefixstate, NULL, F ("0 Restart"));
         mqtt.disconnect ();
         delay (100);
      }
      if (!WiFi.isConnected ())
         ESP.reset ();          // Brutal
      WiFi.disconnect ();
      delay (100);
      ESP.restart ();
      return false;             // Uh
   }
   if (do_upgrade && (int) (do_upgrade - now) <= 0)
   {
      upgrade (appnamelen, appname);
      return false;             // Uh
   }
   // Save settings
   if (settingsupdate && (int) (settingsupdate - now) <= 0)
      settings_save ();
#ifdef GRATARP
   static long
      kickarp = 0;
   if ((int) (kickarp - now) <= 0)
   {
      kickarp = now + GRATARP;
      netif *
         n = netif_list;
      while (n)
      {
         etharp_gratuitous (n);
         n = n->next;
      }
   }
#endif
   // WiFi reconnect
   static long
      sntpbackoff = 100;
   static long
      sntptry = sntpbackoff;
   static long
      wifiok = 0;
   static int
   wifibias[20] = { };
   if (wificonnected)
   {                            // Connected
      if (wifidiscause && !(wificonnected = wificonnect ()))
         debug ("WiFi disconnected");
      else
      {                         // All is well
         wifiscan ();
      }
   } else if ((wificonnected = wificonnect ()))
   {
      wifidown = now - wifiok;
      // debug ("WiFi connected"); // Logged in wifi connect
      sntpbackoff = 100;
      sntptry = now;
   }
   if (WiFi.isConnected ())
      wifiok = now;
   if (wifireset && !do_restart && (int) (now - wifiok) > wifireset * 1000)
      do_restart = now;         // No wifi, restart
   static long
      mqttok = 0;
   if (mqttconnected)
      mqttok = now;
   if (mqttreset && !do_restart && (int) (now - mqttok) > mqttreset * 1000)
      do_restart = now;         // No mqtt, restart
   // More aggressive SNTP
   if (wificonnected && time (NULL) < 86400 && (int) (sntptry - now) <= 0)
   {
      if (sntpbackoff > 100)
         debug ("Poked SNTP again");
      sntptry = now + sntpbackoff;
      if (sntpbackoff < 300000)
         sntpbackoff *= 2;
      sntp_stop ();
      sntp_init ();
   }
   // MQTT reconnnect
   if (mqtthost)
   {                            // We are doing MQTT
      if (!mqtt.loop ())
      {                         // Not working
         const char *
            host = mqttbackup ? mqtthost2 : mqtthost;
         if ((!mqttretry || (int) (mqttretry - now) <= 0) && wificonnected)
         {                      // Try reconnect
            if (domqttopen ())
               mqttconnected = true;
            else
            {                   // Failed reconnect
               if (mqttconnected)
               {                // No longer connected 
                  mqttconnected = false;
                  app_command ("disconnect", (const byte *) host, strlen ((char *) host));
                  debugf ("MQTT failed reconnect %s", host);
               }
               if (mqttbackoff < 30000)
               {                // Not connected to MQTT
                  mqttbackoff *= 2;
                  mqttretry = ((now + mqttbackoff) ? : 1);
               } else
               {
                  if (mqtthost2 && (mqttsha1 || strcmp (mqtthost, mqtthost2)))
                  {
                     mqttbackup = !mqttbackup;
                     mqttretry = 0;
                     mqttbackoff = 1000;
                  }
                  if (!mqttbackup && (wifissid2 || wifissid3))
                     WiFi.disconnect ();        // Retry at wifi level
               }
               return false;
            }
         } else if (mqttconnected)
         {                      // No longer connected
            mqttconnected = false;
            app_command ("disconnect", (const byte *) host, strlen ((char *) host));
            debugf ("MQTT disconnected %s", host);
            return false;
         }
      }
   } else if (mqttconnected)
   {                            // Uh? config change or something
      mqttconnected = false;
      app_command ("disconnect", NULL, 0);
      debug ("MQTT disconnected");
   }
#ifdef	REVKDEBUG
   static long
      ticker = 0;
   if ((int) (ticker - now) <= 0)
   {
      ticker = (now + 10000) / 10000 * 10000;
      //debug ("Tick");
      debugf ("Now=%d W%d%S%S", now, wifidiscause, wificonnected ? PSTR (" WiFi") : PSTR (""),
              mqttconnected ? PSTR (" MQTT") : PSTR (""));
   }
#endif
   return wificonnected;
}

static
   boolean
pubap (boolean retain, const __FlashStringHelper * prefix, const __FlashStringHelper * suffix,
       const __FlashStringHelper * fmt, va_list ap)
{
   if (!mqtt.connected () || !hostname)
      return false;             // No MQTT
   char
      temp[200] = {
   };
   if (fmt)
      vsnprintf_P (temp, sizeof (temp), (PGM_P) fmt, ap);
   char
      topic[101];
   if (suffix)
      snprintf_P (topic, sizeof (topic), PSTR ("%S/%.*s/%s/%S"), (PGM_P) prefix, appnamelen, appname, hostname, (PGM_P) suffix);
   else
      snprintf_P (topic, sizeof (topic), PSTR ("%S/%.*s/%s"), (PGM_P) prefix, appnamelen, appname, hostname);
   return mqtt.publish (topic, temp, retain);
}

static
   boolean
pubap (boolean retain, const char *prefix, const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, va_list ap)
{
   if (!mqtt.connected () || !hostname)
      return false;             // No MQTT
   char
      temp[200] = {
   };
   if (fmt)
      vsnprintf_P (temp, sizeof (temp), (PGM_P) fmt, ap);
   char
      topic[101];
   if (suffix)
      snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s/%S"), prefix, appnamelen, appname, hostname, (PGM_P) suffix);
   else
      snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s"), prefix, appnamelen, appname, hostname);
   return mqtt.publish (topic, temp, retain);
}

static
   boolean
pubap (boolean retain, const char *prefix, const char *suffix, const __FlashStringHelper * fmt, va_list ap)
{
   if (!mqtt.connected () || !hostname)
      return false;             // No MQTT
   char
      temp[200] = {
   };
   if (fmt)
      vsnprintf_P (temp, sizeof (temp), (PGM_P) fmt, ap);
   char
      topic[101];
   if (suffix)
      snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s/%s"), prefix, appnamelen, appname, hostname, suffix);
   else
      snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s"), prefix, appnamelen, appname, hostname);
   return mqtt.publish (topic, temp, retain);
}

static
   boolean
pubap (boolean retain, const char *prefix, const __FlashStringHelper * suffix, unsigned int len, const byte * data)
{
   if (!mqtt.connected () || !hostname)
      return false;             // No MQTT
   char
      topic[101];
   if (suffix)
      snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s/%s"), prefix, appnamelen, appname, hostname, suffix);
   else
      snprintf_P (topic, sizeof (topic), PSTR ("%s/%.*s/%s"), prefix, appnamelen, appname, hostname);
   return mqtt.publish (topic, data, len, retain);
}

static
   boolean
pub (const char *prefix, const char *suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefix, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

static
   boolean
pub (boolean retain, const char *prefix, const char *suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (retain, prefix, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

static
   boolean
pub (const __FlashStringHelper * prefix, const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefix, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

static
   boolean
pub (boolean retain, const __FlashStringHelper * prefix, const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (retain, prefix, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::state (const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (true, prefixstate, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::state (const char *suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (true, prefixstate, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::state (const __FlashStringHelper * suffix, unsigned int len, const byte * data)
{
   return pubap (true, prefixstate, suffix, len, data);
}

