revk/ESP8266-RevK/src/ESPRevK.cpp
boolean ESPRevK::event (const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefixevent, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::event (const char *suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefixevent, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::event (const __FlashStringHelper * suffix, unsigned int len, const byte * data)
{
   return pubap (false, prefixevent, suffix, len, data);
}

boolean ESPRevK::info (const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefixinfo, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::info (const char *suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefixinfo, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::info (const __FlashStringHelper * suffix, unsigned int len, const byte * data)
{
   return pubap (false, prefixinfo, suffix, len, data);
}

boolean ESPRevK::error (const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefixerror, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::error (const char *suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefixerror, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::error (const __FlashStringHelper * suffix, unsigned int len, const byte * data)
{
   boolean
      ret = pubap (false, prefixerror, suffix, len, data);
   return ret;
}

boolean ESPRevK::pub (const char *prefix, const char *suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefix, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::pub (const __FlashStringHelper * prefix, const __FlashStringHelper * suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (false, prefix, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::pub (boolean retain, const char *prefix, const char *suffix, const __FlashStringHelper * fmt, ...)
{
   va_list
      ap;
   va_start (ap, fmt);
   boolean
      ret = pubap (retain, prefix, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean
   ESPRevK::pub (boolean retain, const __FlashStringHelper * prefix, const __FlashStringHelper * suffix,
                 const __FlashStringHelper * fmt, ...)
{
   va_list ap;
   va_start (ap, fmt);
   boolean ret = pubap (retain, prefix, suffix, fmt, ap);
   va_end (ap);
   return ret;
}

boolean ESPRevK::setting (const __FlashStringHelper * tag, const char *value)
{
   char
      temp[50];
   strncpy_P (temp, (PGM_P) tag, sizeof (temp));
   return setting_apply (temp, (const byte *) value, strlen (value));
}

boolean ESPRevK::setting (const __FlashStringHelper * tag, const byte * value, size_t len)
{
   // Set a setting
   char
      temp[50];
   strncpy_P (temp, (PGM_P) tag, sizeof (temp));
   return setting_apply (temp, value, len);
}

boolean ESPRevK::ota (int delay)
{
   debugf ("App OTA request %d", delay);
   if (delay < 0)
      do_upgrade = 0;
   else
      do_upgrade = ((millis () + delay) ? : 1);
}

boolean ESPRevK::restart (int delay)
{
   debugf ("App restart request", delay);
   if (delay < 0)
      do_restart = 0;
   else
      do_restart = ((millis () + delay) ? : 1);
}

static void
myclient (WiFiClient & client)
{
}

#include "lecert.h"
static void
myclientTLS (WiFiClientSecure & client, const byte * sha1)
{
   if (sha1)
      client.setFingerprint (sha1);
   else
      client.setCACert_P (LECert, sizeof (LECert));
   static
      BearSSL::Session
      sess;
   client.setSession (&sess);
}

void
ESPRevK::clientTLS (WiFiClientSecure & client, const byte * sha1)
{
   return myclientTLS (client, sha1);
}

void
ESPRevK::sleep (unsigned long s)
{                               // Total sleep for a while
   if (!s)
      return;                   // Duh
   debugf ("Sleeping for %d seconds, good night...", s);
   if (mqtt.connected ())
   {
      pub (true, prefixstate, NULL, F ("0 Sleep"));
      mqtt.disconnect ();
      delay (100);
   }
   wifi_station_disconnect ();
   delay (100);
   ESP.deepSleep (s * 1000000);
   debug ("WTF");
   // Goes back to reset at this point - connect GPIO16 to RST
}

void
ESPRevK::mqttclose (const __FlashStringHelper * reason)
{
   debugf ("MQTT close %S", (PGM_P) reason);
   if (!mqttconnected)
      return;
   if (reason)
      pub (true, prefixstate, NULL, F ("0 %S"), reason);
   else
      pub (true, prefixstate, NULL, F ("0"));
   mqtt.disconnect ();
   delay (100);
   mqttclientsecure.stop ();
   mqttconnected = false;
   mqttretry = 0;
}

boolean ESPRevK::mqttopen (boolean silent)
{
   debug ("MQTT open");
   if (mqttconnected)
      return true;
   if (!domqttopen (silent))
      return false;
   mqttconnected = true;
   return true;
}

#define s(n) const char * ESPRevK::get_##n(){return n;}
#define f(n,b) const byte * ESPRevK::get_##n(){return n;}
#define n(n,d) int ESPRevK::get_##n(){return n;}
revk_settings
#undef f
#undef n
#undef s
